Revit 2027 API
View.Origin Property
Returns the origin of the screen.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
null if the view is a template.
Remarks
The origin of a plan view is not meaningful.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace